#
# Author        : Zibnitskii Aleksandr
# Date          : 05/05/2020
# Description   : Convert amount to text equivalent
# Task          : Происходит преобразование введеной суммы в её текстовый эквивалент с соблюдением
#               : правил сопряжения для каждого языка. На момент создания доступны русский и
#               : украинские языки. Размерность обрабатываемой суммы - от 0,01 до 2 трлн. единиц
#               : в выбранной валюте

mySum = 19852701
txtRus = {"один","одна","два","две","три","четыр","четыре","сорок","пят","пять","шесть","семь","восемь","девять", \
          "десять","надцать","дцать","десят",\
          "сто","сот","сти","ста",\
          "тысяч","тысяча","тысячи",\
          "миллион","миллиона","миллионов",\
          "миллиард","миллиарда","миллиардов",\
          "триилион","триллиона","триллионов"}
txtUkr = {}


"""
19 девять_надцать миллион-ов 852 восемь-сот пять-десят дв-е тысяч-и семь-сот один

1 = один
5 = пять
10 = десять
15 = пятнадцать
100 = сто
1000 = тысяча
10000 = десять тысяч
100000 = сто тысяч
1000000 = один миллион
"""


def sum2text(sumData):
    txt_result = len(str(sumData))
    print(sumData)
    myData = []
    return txt_result

#    for i in range()
#    for i in range(txt_result):
#
#        myData.append([-1::3])

n = sum2text(mySum)
s1 = str(mySum)
myData = zip(range(3), s1)
#for i in range(n):
#    n = str(mySum)
#    myData.append(int(n[i]))
print(myData)


